#A
  #1
    #x | p(x)
    #0 | 0.0625 
    #1 | 0.25
    #2 | 0.375
    #3 | 0.25
    #4 | 0.0625
  
  #2 
    #My first instinct is 2, because thats the most probabal outcome

  #3
    #x | p(x)  | xp(x)
    #0 | 0.0625| 0
    #1 | 0.25  | 0.25
    #2 | 0.375 | 0.75
    #3 | 0.25  | 0.75
    #4 | 0.0625| 0.25

    #E[x] = 0.25 + 0.25 + 0.75 + 0.75 = 2

  #4
    #x | (x - E[x])**2
    #0 | (0 - 2)**2 = 4
    #1 | (1 - 2)**2 = 1
    #2 | (2 - 2)**2 = 0
    #3 | (3 - 2)**2 = 1
    #4 | (4 - 2)**2 = 4
    
    #Var[x] = 4 + 1 + 0 + 1 + 4 = 10

  #5
    #Std = sqrt(Var[x]) = 3.162

#B
  #1
    #x | p(x)
    #0 | (1-λ)^4 
    #1 | 4λ(1-λ)^3
    #2 | 6λ^2(1-λ)^2
    #3 | 4λ^3(1-λ)
    #4 | λ^4
  
  #2 
    #My first instinct is 4λ, because thats the most probabal outcome and is the amount of flips times probobility

  #3
    #x | p(x)  | xp(x)
    #0 | (1-λ)^4| 0
    #1 | 4λ(1-λ)^3  | 4λ(1-λ)^3
    #2 | 6λ^2(1-λ)^2 | 12λ^2(1-λ)^2
    #3 | 4λ^3(1-λ)  | 12λ^3(1-λ)
    #4 | λ^4 | 4λ^4

    #expanded out

    #E[x] = 4λ - 12λ^2 + 12λ^3 - 4λ^4 + 12λ^2 - 24λ^3 + 12λ^4 + 12λ^3 - 12λ^4 + 4λ^4 = 4λ

  #4
    #x | (x - E[x])**2
    #0 | (0 - 4λ)**2 = 4λ**2
    #1 | (1 - 4λ)**2 
    #2 | (2 - 4λ)**2 
    #3 | (3 - 4λ)**2 
    #4 | (4 - 4λ)**2 
    
    #Var[x] = 4λ**2 + (1 - 4λ)**2 + (2 - 4λ)**2 + (3 - 4λ)**2 + (4 - 4λ)**2 

  #5
    #Std = sqrt(Var[x]) = sqrt(4λ**2 + (1 - 4λ)**2 + (2 - 4λ)**2 + (3 - 4λ)**2 + (4 - 4λ)**2)